from 数据输入 import 玩家属性
from 数据输入 import 输入_JX3BOX格式处理
from 数据输入 import 参考_系数
from 个体对象 import 个体对象


def main():
    玩家 = 个体对象(输入_JX3BOX格式处理.JX3BOX数据().导出数据())
    print(玩家.属性集)
    # 转换系数 = (参考_系数.系数().获取转换系数())
    # arg = 1024 + int(玩家.属性集.破防.阳性内功.最终 * 1024 / 转换系数['破防']) - int((1024 + int(玩家.属性集.破防.阳性内功.最终 * 1024 / 转换系数['破防'])) * 358 / 1024)
    # ret = int(int(玩家.属性集.破招.最终 * 转换系数['破招'] * arg / 1024 * (1024 + int(玩家.属性集.无双.最终 * 1024 / 转换系数['无双'])) / 1024) * (1 + 246 / 1024))
    # print(ret)


if __name__ == '__main__':
    main()
