# coding:utf-8


from 数据输入 import 输入_通用格式处理
from 数据输入 import 输入_JX3BOX格式处理
from 数据输入 import 参考_系数
from 数据输入 import 玩家属性
from 状态效果 import 状态效果


class 个体对象():
    '''
    每个个体对象是一个可操作的独立个体. 例如, 每个符合该属性模板的玩家, NPC 都是一个独立的个体对象.
    '''

    def __init__(self, 属性dict={}) -> None:
        self.属性集 = 玩家属性.属性集(属性dict)
        self.状态集 = 状态效果.状态集()
        self.心法转化初始化()
        # self.状态集.田螺阵 = 状态效果.状态效果(self.属性集.元气, 100, 0, self, True)
        # self.状态集.田螺阵.获得效果()

    def 心法转化初始化(self):
        '''
        初始化心法转化的攻击和会心, 并给出心法主属性(元气)变更的方法.
        '''
        def 获取元气转化额外效果() -> dict:
            额外效果 = {
                '元气转额外阳性内功攻击': 状态效果.状态效果(作用属性=self.属性集.攻击.阳性内功, 作用数值=round(self.属性集.元气.最终 * 1.9)),
                '元气转额外阴性内功攻击': 状态效果.状态效果(作用属性=self.属性集.攻击.阴性内功, 作用数值=round(self.属性集.元气.最终 * 1.9)),
                '元气转阳性内功会心': 状态效果.状态效果(作用属性=self.属性集.会心.阳性内功, 作用数值=round(self.属性集.元气.最终 * 0.29)),
                '元气转阴性内功会心': 状态效果.状态效果(作用属性=self.属性集.会心.阴性内功, 作用数值=round(self.属性集.元气.最终 * 0.29))
            }
            return 额外效果
        元气转化额外效果dict = 获取元气转化额外效果()
        self.状态集 = 状态效果.状态集(元气转化额外效果dict)

        @self.属性集.主属性变更
        def 元气变更装饰器上下文(part):
            '''使用装饰器以在元气变更前后执行一些操作'''
            if part == 1:
                # 元气变更前, 移除元气转换的额外属性
                元气转化额外效果dict = 获取元气转化额外效果()
                self.状态集.批量失去效果(元气转化额外效果dict)
                # for key in 元气转化额外效果dict:
                #     getattr(self.状态集, key).失去效果()
            if part == 2:
                # 元气变更后, 添加元气转换的额外属性
                元气转化额外效果dict = 获取元气转化额外效果()
                self.状态集.批量初始化并获得效果(元气转化额外效果dict)
        # 经过装饰器后, '元气变更装饰器上下文' 函数参数变为: (字段: Any, 额外: Any, 额外1024分比: Any)

        def 元气变更(额外, 额外1024分比):
            '''使用的时候不需要输入字段'''
            元气变更装饰器上下文('元气', 额外, 额外1024分比)
        self.元气变更 = 元气变更

    def 输出dict结果(self):
        ret = self.属性集.输出dict结果()
        return ret

    def __str__(self) -> str:
        return str(self.输出dict结果())


def test_func() -> dict:
    玩家 = 个体对象(输入_JX3BOX格式处理.JX3BOX数据().导出数据())
    print(玩家)


if __name__ == '__main__':
    test_func()
